const categoryConfig = [
  {
    id: "smart_home",
    label: "Умный дом",
    icon: "🏡",
    sub: [
      "Умные лампы",
      "Умные розетки",
      "Камеры наблюдения",
      "Домофоны",
      "Датчики движения",
      "Датчики дыма",
      "Умные замки",
      "Роботы-пылесосы",
      "Голосовое управление",
      "Системы безопасности",
    ],
  },

  {
    id: "clothes",
    label: "Одежда",
    icon: "👗",
    sub: [
      "Мужская одежда",
      "Женская одежда",
      "Детская одежда",
      "Футболки",
      "Джинсы",
      "Куртки",
      "Платья",
      "Обувь",
      "Oversize",
      "Спортивная одежда",
    ],
  },

  {
    id: "electronics",
    label: "Электроника",
    icon: "🔌",
    sub: [
      "Смартфоны",
      "Ноутбуки",
      "Планшеты",
      "Телевизоры",
      "Мониторы",
      "Видеокарты",
      "Power Bank",
      "Зарядные устройства",
    ],
  },

  {
    id: "home_kitchen",
    label: "Дом и кухня",
    icon: "🏠",
    sub: [
      "Кухонная техника",
      "Посуда",
      "Хранение",
      "Уборка",
      "Интерьер",
      "Освещение",
    ],
  },

  {
    id: "sports",
    label: "Спорт",
    icon: "💪",
    sub: [
      "Фитнес оборудование",
      "Йога",
      "Кардио",
      "Спортивное питание",
      "Велоспорт",
      "Спортивная одежда",
    ],
  },

  {
    id: "gaming",
    label: "Игры",
    icon: "🎮",
    sub: [
      "Игровые консоли",
      "Игры",
      "Геймпады",
      "VR",
      "Аксессуары для ПК",
      "Настольные игры",
    ],
  },

  {
    id: "mobile",
    label: "Мобильные",
    icon: "📱",
    sub: [
      "Смартфоны",
      "Смарт-часы",
      "Планшеты",
      "Чехлы",
      "Зарядки",
      "Стекла",
    ],
  },

  {
    id: "audio",
    label: "Аудио",
    icon: "🎧",
    sub: [
      "Наушники",
      "Колонки",
      "Микрофоны",
      "DJ оборудование",
      "Инструменты",
      "Студийное оборудование",
    ],
  },
];

export default categoryConfig;